Revit 2027 API
SpecTypeId.HvacTemperature Property
 Temperature, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HvacTemperature { get; }
Public Shared ReadOnly Property HvacTemperature As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HvacTemperature {
	ForgeTypeId^ get ();
}
static member HvacTemperature : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace